scripts/report/statistics.json
{
  "抢券请求 POST /user/coupon/grab/4" : {
    "transaction" : "抢券请求 POST /user/coupon/grab/4",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.947999999999995,
    "medianResTime" : 6.0,
    "minResTime" : 2.0,
    "maxResTime" : 122.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 18.899999999999864,
    "pct3ResTime" : 107.0,
    "throughput" : 203.210729526519,
    "receivedKBytesPerSec" : 42.76553927047348,
    "sentKBytesPerSec" : 65.70612553342816
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.947999999999995,
    "medianResTime" : 6.0,
    "minResTime" : 2.0,
    "maxResTime" : 122.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 18.899999999999864,
    "pct3ResTime" : 107.0,
    "throughput" : 203.210729526519,
    "receivedKBytesPerSec" : 42.76553927047348,
    "sentKBytesPerSec" : 65.70612553342816
  }
}